cf/Reports/РегистрРасчетУбытковПрошлыхЛет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>РегистрРасчетУбытковПрошлыхЛет</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/Enums/ПрибылиИУбытки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПрибылиИУбытки</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрибыльУбытокОтПродаж</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СальдоПрочихДоходовИРасходов</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧрезвычайныеДоходыРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыеСанкции</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Reports/РегистрРасчетУбытковПрошлыхЛет/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт

	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(ДатаНач, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация);
	НазваниеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + " / " + Организация.КПП;
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	// Проверим заполнение обязательных реквизитов
	Если НалоговыйУчет.ПроверитьЗаполнениеОбязательныхРеквизитов(ДатаНач,ДатаКон,Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДатаНач",       НачалоДня(НачалоГода(ДатаНач)));
	Запрос.УстановитьПараметр("ДатаКон",       КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("СчетУбытков",   ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("ВидСубконто",   ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("Счет99",        ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиБезНалогаНаПрибыль);
	Запрос.УстановитьПараметр("Счет909",       ПланыСчетов.Хозрасчетный.ПрибыльУбытокОтПродаж);
	Запрос.УстановитьПараметр("Счет919",       ПланыСчетов.Хозрасчетный.СальдоПрочихДоходовИРасходов);
	Запрос.УстановитьПараметр("ПрибылиИУбытки",Перечисления.ПрибылиИУбытки.ПрибыльУбытокОтПродаж);
	Запрос.УстановитьПараметр("ПрибылиИУбытки91",Перечисления.ПрибылиИУбытки.СальдоПрочихДоходовИРасходов);
	Запрос.УстановитьПараметр("Убытки",        Перечисления.Видырбп.УбыткиПрошлыхЛет);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УбыткиПрошлыхЛет.Период КАК ДатаОперации,
	|	УбыткиПрошлыхЛет.Субконто1.Наименование КАК ГодУбытка,
	|	УбыткиПрошлыхЛет.СуммаНУОборотКт - УбыткиПрошлыхЛет.СуммаНУОборотДт КАК УбытокПринятый,
	|	ТекущаяПрибыль.Прибыль КАК Прибыль,
	|	НачОстаткиУбытковПрошлыхЛет.СуммаНУОстатокДт КАК ОстатокНачальный
	|ИЗ
	|	(ВЫБРАТЬ
	|		-ХозрасчетныйОбороты.СуммаНУОборот КАК Прибыль,
	|		ХозрасчетныйОбороты.Период КАК Период
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&ДатаНач,
	|				&ДатаКон,
	|				Месяц,
	|				Счет В ИЕРАРХИИ (&Счет99),
	|				,
	|				Организация = &Организация
	|			    И (Субконто1 = &ПрибылиИУбытки Или Субконто1 = &ПрибылиИУбытки91),
	|				КорСчет В ИЕРАРХИИ (&Счет909)
	|					ИЛИ КорСчет В ИЕРАРХИИ (&Счет919),
	|				) КАК ХозрасчетныйОбороты) КАК ТекущаяПрибыль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&ДатаНач,
	|				&ДатаКон,
	|				Месяц,
	|				Счет В ИЕРАРХИИ (&СчетУбытков),
	|				&ВидСубконто,
	|				Организация = &Организация
	|					И Субконто1.ВидРБП = &Убытки,
	|				КорСчет В ИЕРАРХИИ (&Счет99),
	|				) КАК УбыткиПрошлыхЛет
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ХозрасчетныйОстатки.СуммаНУОстатокДт КАК СуммаНУОстатокДт,
	|				ХозрасчетныйОстатки.Субконто1 КАК Субконто1
	|			ИЗ
	|				РегистрБухгалтерии.Хозрасчетный.Остатки(
	|						&ДатаНач,
	|						Счет В ИЕРАРХИИ (&СчетУбытков),
	|						&ВидСубконто,
	|						Организация = &Организация
	|							И Субконто1.ВидРБП = &Убытки) КАК ХозрасчетныйОстатки) КАК НачОстаткиУбытковПрошлыхЛет
	|			ПО УбыткиПрошлыхЛет.Субконто1 = НачОстаткиУбытковПрошлыхЛет.Субконто1
	|		ПО (УбыткиПрошлыхЛет.Период = ТекущаяПрибыль.Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации,
	|	ГодУбытка
	|ИТОГИ
	|	СУММА(УбытокПринятый),
	|	МИНИМУМ(Прибыль),
	|	СУММА(ОстатокНачальный)
	|ПО
	|	ДатаОперации,
	|	ГодУбытка";
	Результат = Запрос.Выполнить();

	ОбластьПодвал        = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаПериод  = Макет.ПолучитьОбласть("СтрокаПериода");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");
	
	ПрошлыеПринятыеУбытки = Новый Соответствие;
	

	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);

	ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаОперации");
	ИтогоСуммаПрибыли = 0;

	Пока ВыборкаПериод.Следующий() Цикл
				
		ОбластьСтрокаПериод.Параметры.ДатаОперации      = ПредставлениеПериода(НачалоДня(ВыборкаПериод.ДатаОперации), КонецДня(КонецМесяца(ВыборкаПериод.ДатаОперации)), "ФП = Истина");
		
		ПрошлыйПринятыйУбыток = ПрошлыеПринятыеУбытки.Получить(ВыборкаПериод.ГодУбытка);
		Если ПрошлыйПринятыйУбыток = Неопределено Тогда
			ПрошлыйПринятыйУбыток = 0;
		КонецЕсли;
		ПрошлыеПринятыеУбытки.Вставить(ВыборкаПериод.ГодУбытка, ПрошлыйПринятыйУбыток + ВыборкаПериод.УбытокПринятый);
		
		ОбластьСтрокаПериод.Параметры.УбытокТекущий     = ВыборкаПериод.УбытокПринятый;
		ОбластьСтрокаПериод.Параметры.Убыток     = ПрошлыйПринятыйУбыток + ВыборкаПериод.УбытокПринятый;
		ОбластьСтрокаПериод.Параметры.ОстатокНачальный  = ВыборкаПериод.ОстатокНачальный - ПрошлыйПринятыйУбыток;
		ОбластьСтрокаПериод.Параметры.ОстатокКонечный   = ВыборкаПериод.ОстатокНачальный - ПрошлыйПринятыйУбыток - ВыборкаПериод.УбытокПринятый;
		
		ИтогоСуммаПрибыли = ИтогоСуммаПрибыли + ВыборкаПериод.Прибыль;
		ОбластьСтрокаПериод.Параметры.Прибыль           = ИтогоСуммаПрибыли;
		ОбластьСтрокаПериод.Параметры.ПрибыльТекущая    = ВыборкаПериод.Прибыль;
		ОбластьСтрокаПериод.Параметры.Процент           = 100 * (ПрошлыйПринятыйУбыток + ВыборкаПериод.УбытокПринятый) / ИтогоСуммаПрибыли;
		
		ДокументРезультат.Вывести(ОбластьСтрокаПериод);
		Выборка = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ГодУбытка");
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.ГодУбытка         = Выборка.ГодУбытка;
			ПрошлыйПринятыйУбыток = ПрошлыеПринятыеУбытки.Получить(Выборка.ГодУбытка);
			Если ПрошлыйПринятыйУбыток = Неопределено Тогда
				  ПрошлыйПринятыйУбыток = 0;
			  КонецЕсли;
			  
			ПрошлыеПринятыеУбытки.Вставить(Выборка.ГодУбытка, ПрошлыйПринятыйУбыток + Выборка.УбытокПринятый);
			ОбластьСтрока.Параметры.УбытокТекущий     = Выборка.УбытокПринятый;
			ОбластьСтрока.Параметры.Убыток     = ПрошлыйПринятыйУбыток + Выборка.УбытокПринятый;
			ОбластьСтрока.Параметры.ОстатокНачальный  = Выборка.ОстатокНачальный - ПрошлыйПринятыйУбыток;
			ОбластьСтрока.Параметры.ОстатокКонечный   = Выборка.ОстатокНачальный - ПрошлыйПринятыйУбыток - Выборка.УбытокПринятый;
			
			
			ДокументРезультат.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЦикла;

	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);

	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = СтруктураЛиц.ОтветственныйЗаРегистры;

	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры // СформироватьОтчет

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
